from itertools import product
# ╭─────────────────────╮
# │ [Cartesian Product] │
# ╰─────────────────────╯
# example to knowe the def
colors=["red","blue","black"]
sizes=["s","m","l"]
tshirts = [(color, size) for color in colors for size in sizes]
print(tshirts)
# NOTE: هنا لما نيجي نقراها هنلاقي ان الموضوع بسيط اللوب على اللون هيجيب كل الالوان بعدها اللوب على المقاس هياخد كل لون يديه المقاسات الموجوده يعني جمله انجليزي والله اقرها هتفهم
# ══════════════════════════════════════════════════════════════════════════════
# في طرق تانيه اكيد في طريقتين اول طريقه هى الطريقه العاديه 
tshirts =[]
for color in colors:
    for size in sizes:
        tshirts.append((color,size))
print(tshirts)
# بس دي طريقه رخمه وطويله بس هتنفع يعني اهي موجوده 
# ══════════════════════════════════════════════════════════════════════════════
# الطريقه التالته دي بايثون مدياني هديه في module
tshirts = list(product(colors,sizes))
print(tshirts)
# ══════════════════════════════════════════════════════════════════════════════
# كلهم نفس النتيجه لكل واحده فيهم استخدام 
# الهدف اننا نفهم الضرب الديكارتي وازاي بايثون بيتعامل مع ال nested loops
# ونعرف كمان ان Listcomps are a one-trick pony يعني هو معمول عشان حاجه واحده بس هى انشاء قوائم حصرا لو البيانات ضخمه هنحتاج Lazily عشان منملاش الميموري مرة واحده وده هيكون بدايه كلامنا عن Generator Expression--
# ══════════════════════════════════════════════════════════════════════════════
# learn more about itertools:
# ╭────────────────────────────────────────────────────╮
# │ [https://docs.python.org/3/library/itertools.html] │
# ╰────────────────────────────────────────────────────╯