from collections import namedtuple

# (function) namedtuple: def namedtuple(
#  typename: str,
#  field_names: Iterable[str] | str,
#  *,
#  rename: bool = False,
#  module: str | None = None,
#  defaults: Iterable[Any] | None = None
# ) -> type[tuple[Any, ...]]: ...
# Go to str | Iterable | bool

# ╭───────────────────────────────────────────╮
# │ [firstlly we need learn more about tuple] │
# ╰───────────────────────────────────────────╯
# ال tuple او هو هيكل بيانات في بايثون بيسمحلنا نضيف عده عناصر في متغير واحد 
# مثل : person = ("أحمد", 28, "مهندس") 
# Immutable => غير قابل للتعديل 
# Ordered => مرتب
# indexed => تبدا عناصره من 0 ويمكن الوصل لعناصره من خلال Indexes
# مثل print (person[0])=> أحمدor by slices مثل print(person[:3])=> احمد , 28, مهندس
# يستهلك ذاكرة اقل في من lists QUESTION: : Why???? 
# Answer: تخيل معايا ان معاك زجاجتين واحده مصنوعه من المطاط والاخرى من الزجاج وطلبت منك تحط فيهم نفس كميه المياه ثم تحطهم في التلاجه بعد 5 دقايق طلبت منك تطلعهم وتملاهم مايه اكتر هنلاحظ ان الزجاجه الاولى بدا حجمها يكبر والتانيه وقعت المياه الزياده لانها solid تمام دلوقتي نرجع نحطهم في التلاجه ايه اللي هنلاحظه تاني ان الاولى اخدت مساحه من التلاجه اكثر فاصبح من الضروري نوفرلها مساحه اكبر من الاولى تمام دلوقتي نسيبهم وبعد خمس دقايق تانيين حد تاني حب يحط زجاجه مياه تانيه فتح التلاجه وحطها وسط الزجاجتين الاوليين ولاحظنا ان مفيش مساحه لحاجه تاني تمام دلوقتي في طلب ضروري اننا عايزين نملى الزجاجه المصنوعه من المطاط بمياه اكتر طلعناها وملينها بس قابلتنا مشكله لما جينا نحطها ان ملهاش مكان نحل المشكله دي ازاي نرجع من الاول ونشوف لو الزجاجه من المطاط(قابله للزياده) هنحجزلها مساحه من التلاجه اكبر من المساحه اللي بنحجزها للزجاجه المصنوعه من الزجاج حتى لو فيهم نفس كميه المياه تحسبا لاي زياده //=>هنا احتجنا اول حاجه مساحه زياده تاني حاجه مراقب عشان يخلي في مساحه زياده تالت حاجه لما تشيل الازازه بالكامل هتحتاج تشيل مكان اكبر من الحجم الحقيقي وده بيستهلك طاقه 
# الان ال tuple = الزجاج ال list = المطاط
# بس برضو في مشكله في ال tuple ناخد مثال عشان نفهم اكتر سبب المشكله 
# عندنا تطبيق بياخد احداثيات موقع وبيعرض للمستخدم مدى ارتفاع هذا الموقع عن موقع المستخدم الحالي
# تخزين إحداثيات موقع جغرافي (خط العرض، خط الطول، الارتفاع)
location_one =(30.452,35.025,15)
location_tow = (30.0444, 31.2357, 15)
h1 = location_one[2]
h2 = location_tow[2]
# من المفترض ان شكل الداله تقريبا هيكون انها بتاخد ارتفاع الاول تطرحه من الارتفاع التاني وتجيبله البعد بينه وبين التاني 
# يعني الداله هتاخد معاملين h1,h2 بس عندنا هنا مشكله المستخدم مش بيدخل احداثيات موقعه بايده هو بس بيشغل ميزه ال gps يعني لازم الاول نعمل متغير نسجل في الارتفاع فقط تمام
def Distance(h1,h2):
    Calculating_distance = abs(h1-h2)
    return f"Hello The distance between you and your friend is {Calculating_distance}"
#  حسنا عندنا دلوقتي كل حاجه جاهزه نبدا نكتب دالتنا ونشوف
r = Distance(h1,h2)
print(r)
# OUTPUT: Hello The distance between you and your friend is 10
# تمام النتيجه صحيحه بس خلينا نبص على شكل الاحداثيات مثلا لو كانت location_one =(30.452,35.025)ونشغل الكود تاني 
# OUTPUT: IndexError: tuple index out of range
# دلوقتي ظهرت مشكله تانيه ان لو المستخدم ارتفاعه صفر هيطلع ايرور في حين ان لو المستخدم في نفس مستوى سطح البحر ف ارتفاعه صفر ف من المفترض النتيجه تكون ارتفاع الشخص التاني وليس IndexError نحاول نحل المشكله 
# مثلا ممكن نحط شرط ان لو ال index 2 مش موجود يطبع القيمه التانيه
try:  location_tow[2]
except IndexError : print(f"your height is {location_one[2]}")

try: location_one[2]
except IndexError :  print(f"your height is {location_tow[2]}")
# تمام حلينا المشكله بس برضو ممكن يكونوا في نفس المستوى والاتنين على الارض يعني ارتفاعهم مش موجود هنا هنعمل برضو try بس المرة دي هنستخدم and 
# بس برضو ممكن يبقا في index 3 اللي هو نسبه الخطا او الزمن لو الموقع ده موقع مباشر ممكن برضو نعمل داله تعمل ده بس الموضوع هيطول في غيرنا عرفوا ان الموضوع هيطول وعشان كدا بندرس ال namedtuple
# FUNCTION: nametuple() =>typename: str,field_names: Iterable[str] | str
location = namedtuple('location',['lines','circle','height','t'])
l1 = location(lines=3.0055,circle=2.0255,height=25,t=None)
print(l1.t)
# كدا بقا الامر مريح اكتر ومش محتاج زحمه كبيرة بس برضو لسه في مشكله بناءا على منطق المثال بتاعنا ف احنا بناخد احداثيات الموقع الخاصه بالمستخدم عن طريق تفعيله لخاصيه الوصول للموقع ممكن الموقع يرجع 3 خانات او 2 بس ساعتها هيطلع ايرور الحل نحط قيم افتراضيه للعناصر اللي ممكن تكون مش موجوده اللي هى 'height','t' ممكن نعمل داله بسيطه
def defults(lines,circle,height=0,t=0):
    if lines is None or circle is None :
        raise IndexError('this feild is required')
    return location(lines,circle,height,t)
# دلوقتي بقا عندنا قيم معروف هى بتاعت ايه وكمان داله بتختبر الموقع قبل الحساب وبعد الداله دي هيكون حساب البعد سهل وممكن نعمله في متغير فقط ف مثلا
l1=defults(3.025,0.98,25)
l2=defults(2.98,2.55,10)
d = abs(l1.height - l2.height)
print(d)
# ══════════════════════════════════════════════════════════════════════════════
# FUNCTION: _make()=> بتحولي ال list او ال tuple ل nametuple
Person = namedtuple('Person', ['name', 'age', 'job'])
pd =("mohamed",19,"aly")
p1 = Person._make(pd)
print(p1)
# ══════════════════════════════════════════════════════════════════════════════
# FUNCTION: _asdict()=> بتحول ال nametuple ل dict 
p1_dict = p1._asdict()
print(p1_dict)
# ══════════════════════════════════════════════════════════════════════════════
# FUNCTION: _replace() => تعديل قيمه 
p1_update = p1._replace(age=20)
print(p1_update)
# ══════════════════════════════════════════════════════════════════════════════
# FUNCTION: _fields=> بتطلع اسماء الحقول
print(p1._fields)

